Tekla Open API Reference for Tekla Structures 2025
MaterialCatalog Class
 The MaterialCatalog class represents a group of controls to select materials using the material catalog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.MaterialCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class MaterialCatalog : UserControl
Public Class MaterialCatalog
	Inherits UserControl
The MaterialCatalog type exposes the following members.
Constructors
Name | Description
MaterialCatalog()
 Initiates a new instance of the control.
MaterialCatalog(String)
 Creates a new instance of the MaterialCatalog and will select the material (if available) in the tree.
Top
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedMaterial
 Gets the selected material in the control.
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace